# StructuralElementMayNotBeSupported Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..StructuralElementMayNotBeSupported Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Structural Element may not be supported -- verify support for Element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StructuralElementMayNotBeSupported { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralElementMayNotBeSupported As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StructuralElementMayNotBeSupported {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace